{
  "404": {
    "title": "Página no encontrada",
    "home": "Volver al inicio"
  },
  "testim": {
    "a": "Es muy confiable, trabaja rápido y entrega resultados de alta calidad. Definitivamente vale lo que cuesta.",
    "b": "Estuvimos semanas trabados con un problema crítico, y lo resolvió en cuestión de horas. Muy inteligente y fácil de tratar.",
    "c": "Trabajar con él fue como tener un miembro más del equipo que realmente se preocupa. Excelente comunicación, sin vueltas, y con resultados reales."
  },
  "LanguageSwitcher": {
    "switchLanguage": "Cambiar a Inglés"
  },
  "ContactDialog": {
    "title": "Contactar"
  },
  "Experience": {
    "remote": "Remoto",
    "hybrid": "Híbrido",
    "experience": "Experiencia"
  },
  "HeroSection": {
    "availability": "Disponible para nuevos proyectos",
    "contact": "Contactar",
    "download": "Currículum",
    "position": "Desarrollador de Software",
    "position2": "Especialista en Backend",
    "language": "(Click the flag to switch to English!)",
    "location": "Operando desde Villa Carlos Paz, Córdoba",
    "subtitle": "Dedicado a transformar <em>ideas complejas</em> en <em>soluciones eficaces</em>",
    "resumeUrl": "https://drive.google.com/file/d/1fevdA01nCS-LsR5CR2TaAEzGHW3O0WPO/view?usp=drive_link"
  },
  "ProjectsSection": {
    "title": "Proyectos Destacados",
    "pc": "¡Pasa el ratón por encima de las imágenes para verlas en color!",
    "mobile": "¡Mantén presionadas las imágenes para verlas en color!",
    "next" : "Siguiente",
    "previous" : "Anterior",
    "home" : "← Volver al inicio",

    "Deporturnos": {
      "name": "Deporturnos",
      "description": "Plataforma para la gestión intergal de canchas deportivas.",
      "linkVisitSite": "Sitio Web",
      "linkViewCode": "Repositorio Backend",
      "linkViewCode2": "Repositorio Frontend",
      "linkVisitDocs": "Documentación",
      "about": "Deporturnos es una aplicación web que simplifica la reserva canchas en centros deportivos con un diseño intuitivo. Su backend, desarrollado desde cero, asegura un rendimiento seguro y confiable. \nAdemás, proporciona una solución completa para la administración de reservas, gestión de usuarios y más."
    },
    "ProductManager": {
      "name": "Product Manager App",
      "description": "API RESTful diseñada para manejar un CRUD completo de productos.",
      "linkVisitSite": "Sitio Web",
      "linkViewCode": "Repositorio",
      "linkVisitDocs": "Documentación",
      "about": "Esta aplicación es una herramienta integral para la gestión de productos, diseñada para ser escalable y fácil de usar. Incluye autenticación JWT, carga de archivos, documentación Swagger, pruebas automatizadas y vistas con EJS."
    },
    "Poui": {
      "name": "Poui",
      "description": "Página web diseñada para una emprendedora dedicada a la venta de velas aromáticas y difusores.",
      "linkVisitSite": "Sitio Web",
      "linkViewCode": "Repositorio",
      "about": "El sitio ofrece una experiencia cálida y elegante que refleja la esencia del negocio, con un diseño centrado en destacar la calidad y variedad de productos relacionados con la aromaterapia y el bienestar. \nIncluye un catálogo interactivo, formulario de contacto y una sección 'Quiénes somos'."
    },
    "TaskList": {
      "name": "TaskList",
      "description": "Una simple lista de tareas que te ayudará mucho.",
      "linkVisitSite": "Sitio Web",
      "linkViewCode": "Repositorio",
      "about": "Se trata de una simple lista de tareas, que utiliza React Router para la navegación y almacenamiento en localStorage."
    }
  },
  "AboutSection": {
    "title": "Sobre mí",
    "d0": "Soy Joaquín Dario Olivero, un Desarrollador de Software con una sólida base en la construcción de aplicaciones robustas, con una particular inclinación hacia las REST APIs escalables.",
    "d1": "Mi formación académica, que incluye un Título Técnico en Desarrollo de Software del Instituto Universitario Aeronáutico  con un GPA sobresaliente y una calificación de 10/10 en mi tesis por el proyecto DeporTurnos, me ha proporcionado un profundo conocimiento en arquitectura de software, metodologías ágiles y una sólida mentalidad analítica.",
    "d2": "Aunque mi pasión y experiencia inicial residen en el desarrollo backend, estoy motivado a adaptarme y contribuir en diversas áreas del desarrollo, siempre comprometido con la optimización del código y la resolución proactiva de problemas, con el objetivo de contribuir en proyectos innovadores dentro de equipos dinámicos.",
    "mab": "Más sobre mí"
  },
  "SkillsSection": {
    "title": "Tecnologías empleadas recientemente",
    "defaultDescription": "Pasa el cursor sobre una habilidad para ver más detalles.",
    "Python": "Lenguaje versátil para análisis de datos, automatización y desarrollo web.",
    "Docker": "Plataforma que facilita el despliegue de aplicaciones en entornos portables.",
    "Azure": "Nube de Microsoft con enfoque en IA avanzada, datos y escalabilidad.",
    "Supabase": "BaaS de código abierto para bases de datos, autenticación y almacenamiento.",
    "DotNet": "Framework para crear aplicaciones empresariales y soluciones de negocio.",
    "n8n": "Automatización con IA y agentes inteligentes para flujos de trabajo modernos.",
    "OpenAI": "Modelos y API de IA para automatización, chatbots y apps inteligentes.",
    "React": "Herramienta para apps web dinámicas y rápidas (¡como esta!)."
  },
  "ContactSection": {
    "question": "¿Necesitas ayuda con tu proyecto?",
    "services": "Servicios disponibles",
    "servicesDevelopment": "Programación",
    "backendDevelopment": "Desarrollo Backend",
    "servicesDigitalMarketing": "Redes",
    "servicesContentCreation": "Creación de Contenido",
    "servicesSEO": "SEO y optimización web",
    "servicesOther": "Otros",
    "servicesInformationalInterviews": "Entrevistas informativas",
    "servicesTranslation": "Traducciones (Inglés, Español)",
    "contact": "Contáctame"
  },
  "Header": {
    "contact": "Contacto",
    "about": "Sobre mí",
    "projects": "Proyectos",
    "tech": "Tecnologías",
    "language": "Idioma",
    "theme": "Tema"
  },
  "CopyEmailButton": {
    "copy": "Click para copiar",
    "toast": "¡Estaré esperando tu mensaje!"
  },
  "Form": {
    "name": "Juan Pérez",
    "email": "ejemplo@gmail.com",
    "message": "¡Hola Joaco! Me comunico porque...",
    "messageError": "Por favor, ingrese un mensaje más largo.",
    "emailError": "Por favor, ingrese un correo válido.",
    "nameError": "Por favor, ingrese su nombre.",
    "success": "Gracias por tu consulta. Responderé a la brevedad.",
    "submit": "Enviar",
    "somethingWrong": "Algo salió mal. Por favor, inténtelo de nuevo más tarde.",
    "networkError": "Error de red. Intente nuevamente.",
    "nameLabel": "Nombre",
    "emailLabel": "Correo",
    "messageLabel": "Mensaje"
  },
  "Page": {
    "tohome": "← Volver al inicio"
  }
}